qiaolun/m8/boards.txt

atmega8q8.name=ATmega8 8MHz

atmega8q8.upload.using=arduino
atmega8q8.upload.maximum_size=7168
atmega8q8.upload.speed=19200

atmega8q8.bootloader.low_fuses=0xCA
atmega8q8.bootloader.high_fuses=0xFF
atmega8q8.bootloader.extended_fuses=0xFF
atmega8q8.bootloader.path=atmega8_8m
atmega8q8.bootloader.file=ATmegaBOOT.hex
atmega8q8.bootloader.unlock_bits=0x3F
atmega8q8.bootloader.lock_bits=0x0F

atmega8q8.build.mcu=atmega8
atmega8q8.build.f_cpu=8000000L
atmega8q8.build.core=arduino
atmega8q8.build.variant=standard

